Revit 2024 API
GeomCombinationSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual GeomCombinationSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As GeomCombinationSetIterator
Visual C++
public:
virtual GeomCombinationSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
GeomCombinationSet Class
Autodesk.Revit.DB Namespace